#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Redundant ignore_changes element

  on .terraform/modules/db/modules/db_instance/main.tf line 26, in resource "aws_db_instance" "this":
  26: resource "aws_db_instance" "this" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute latest_restorable_time is decided by the provider alone and
therefore there can be no configured value to compare with. Including this
attribute in ignore_changes has no effect. Remove the attribute from
ignore_changes to quiet this warning.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.db.random_password.master_password[0]: Refreshing state... [id=none]
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.db.module.db_instance.aws_cloudwatch_log_group.this["postgresql"]: Refreshing state... [id=/aws/rds/instance/walrus/postgresql]
module.db.module.db_instance.data.aws_partition.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0b1543f92c5397fb3]
data.aws_availability_zones.available: Reading...
module.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=walrus-20220522021357134400000001]
module.db.module.db_instance.aws_cloudwatch_log_group.this["upgrade"]: Refreshing state... [id=/aws/rds/instance/walrus/upgrade]
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=1813475199]
module.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=rds-monitoring-role]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-045e2073a2941e5a3]
module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=rds-monitoring-role-20220522020958737700000003]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-05c1138bcfc764596]
module.security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0bdb6152121bdff35]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-025adafa141f5c430]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0ce877ea3dc549fbd]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0bbadf421d9ba7083]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0c9f436e891e75eb4]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-00bc479290f40aa08]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-07ae3feedf6adbf86]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-033aba250477dcf29]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-033f63d9b7ed2003f]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-02a8de384520d175b]
module.vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-002750f72385f5949]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-03dbafad051f84b77]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0a5cc4458fb5fd873]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0070052ea1ae823e8]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-02a5856553bd31056]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-03dbafad051f84b771080289494]
module.vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-07ec54632aec475cb]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0386e5c2eadff773e]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0890c8b9bebb9f34f]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=dev-vpc]
module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-715892711]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-03373b4c21a3ce9c8]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01a99034757ed83a5]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-017244bbba4face45]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-08c247a9fb74f009a]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-033aba250477dcf291080289494]
module.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=walrus]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ecs.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "services"
      + tags_all           = {
          + "Environment"      = "Development"
          + "TerraformManaged" = "True"
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ecs.aws_ecs_cluster_capacity_providers.this[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "FARGATE",
        ]
      + cluster_name       = "services"
      + id                 = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Redundant ignore_changes element

  on .terraform/modules/db/modules/db_instance/main.tf line 26, in resource "aws_db_instance" "this":
  26: resource "aws_db_instance" "this" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute latest_restorable_time is decided by the provider alone and
therefore there can be no configured value to compare with. Including this
attribute in ignore_changes has no effect. Remove the attribute from
ignore_changes to quiet this warning.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @csepulveda, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*